import React from "react";
import "bootstrap/dist/css/bootstrap.min.css";

const TermsOfService = () => {
  return (
    <div>
      <h3>
        <strong>ЗАГАЛЬНІ ПОЛОЖЕННЯ</strong>
      </h3>
      <ol>
        <li>Управління Інтернет-магазином здійснює Продавець.</li>
        <li>
          Продавець &mdash; це сторона Договорів купівлі-продажу, що укладаються
          між Продавцем і Клієнтом.
        </li>
        <li>
          На даний момент здійснювати покупки в Інтернет-магазині можна лише
          через зареєстрований Обліковий запис Клієнта згідно з п. 1 розділу VI
          Правил.
        </li>
        <li>
          Продавець надає Клієнтам безплатні Електронні послуги на умовах,
          детально описаних у Розділі V.
        </li>
        <li>
          Оголошення, реклами, прайс-листи та інша інформація, що розміщується
          Продавцем в Інтернет-магазині або в профілях Продавця в соціальних
          мережах, адресована широкій публіці Клієнтів або окремим особам, в
          разі сумнівів розглядається не за пропозицію Продавця, а за запрошення
          до укладення договору (відповідно до ст. 71 Цивільного кодексу).
        </li>
        <li>
          Розміщення Замовлення Клієнтом являє собою пропозицію, адресовану
          Продавцю у відповідь на запрошення до укладення договору. Тільки
          прийняття Замовлення Продавцем, відправлене на підтвердження прийняття
          Замовлення до виконання, є укладенням Договору купівлі-продажу.
        </li>
        <li>
          Перед розміщенням Замовлення Клієнт зобов&rsquo;язаний ознайомитися з
          положеннями Правил і дотримуватися їх.
        </li>
        <li>
          Продавець може організовувати і проводити всілякі акції на Товари,
          пропоновані в Інтернет-магазині.
        </li>
        <li>
          Продавець щонайпізніше, коли Клієнт висловить свою волю щодо
          зобов&rsquo;язання Договором купівлі-продажу, інформує Клієнта про
          функціонал Товарів з цифровими елементами та Цифровим контентом, а
          також про застосовні технічні заходи щодо їх захисту (наприклад,
          шляхом розміщення конкретної інформації на картці Товару).
        </li>
        <li>
          Продавець щонайпізніше, коли Клієнт висловить свою волю щодо
          зобов&rsquo;язання Договором купівлі-продажу, інформує Клієнта про
          значення сумісності та взаємодії Товарів з цифровими елементами або
          Цифровим контентом (наприклад, шляхом розміщення конкретної інформації
          на картці Товару).
        </li>
      </ol>
      <h3>
        <strong>ЗАМОВЛЕННЯ</strong>
      </h3>
      <ol>
        <li>
          Оформлення Замовлень в Інтернет-магазині можливо як для зареєстрованих
          Клієнтів, які мають доступ до Облікового запису Клієнта, так і для
          Клієнтів, які не зареєстрували Обліковий запис Клієнта.
        </li>
        <li>
          Клієнт оформляє Замовлення в Інтернет-магазині через Обліковий запис
          Клієнта або без Реєстрації, заповнивши форму Замовлення на Сайті та
          обравши відповідну кнопку &laquo;Замовлення підтверджую&raquo;.
        </li>
        <li>
          Перед оформленням Замовлення Покупець зобов&rsquo;язаний підтвердити,
          що ознайомився з Регламентом Інтернет-магазину і приймає положення, що
          містяться в ньому.
        </li>
        <li>
          Після оформлення Замовлення Продавець зобов&rsquo;язаний негайно
          підтвердити його отримання та направити заяву про прийняття Замовлення
          до реалізації на адресу електронної пошти. У разі оформлення Замовлень
          по телефону з власної ініціативи Клієнта, Продавець негайно
          підтверджує отримання Замовлення та прийняття його до реалізації
          шляхом надсилання SMS-повідомлення або електронної пошти, вказаної
          Клієнтом.
        </li>
        <li>
          Складення Замовлення Клієнтом ще не є укладенням Договору
          купівлі-продажу. Договір купівлі-продажу між Клієнтом і Продавцем
          укладається в момент отримання Клієнтом заяви Продавця про прийняття
          Замовлення до реалізації.
        </li>
        <li>
          У разі недоступності товарів/послуг або інших перешкод, що виникають з
          боку Продавця, Продавець індивідуально зв&rsquo;яжеться з Покупцем
          через адресу електронної пошти або за номером телефону вказаним
          Клієнтом.
        </li>
        <li>
          Інформація про статус Замовлення надається Замовнику в один або
          декілька доступних методів інформування: статус в Обліковий запис,
          лист на адресу електронної пошти, вказану у формі Замовлення,
          SMS-повідомлення на вказаний Замовником номер телефону, онлайн чат в
          Обліковий записі. Покупець також може самостійно направляти запити
          Продавцю про статус Замовлення, направляючи їх на контактні дані,
          зазначені в розділі III Положення. Крім того, Клієнт, який має
          Обліковий запис, може самостійно перевірити статус Замовлення в
          Обліковому записі Клієнта.
        </li>
        <li>
          Клієнт може анулювати Замовлення до отримання повідомлення від
          Продавця про передачу Товару на доставку, зв&rsquo;язавшись з
          Продавцем, зокрема електронною поштою, по телефону або за допомогою
          форми в Обліковому записі, що не порушує законодавче право Споживача
          на відмову від Договору купівлі-продажу. Можливість скасування
          Замовлення не поширюється на Товари, виготовлені відповідно до
          індивідуальних потреб і специфікацій Замовника.
        </li>
      </ol>
      <h3>
        <strong>ЦІНИ ТА ОПЛАТА</strong>
      </h3>
      <ol>
        <li>
          <p>Клієнт може обрати такі форми оплати замовленого Товару:</p>
          <ul>
            <li>звичайним (традиційним) банківським переказом</li>
            <li>
              платіжною карткою або банківським переказом через зовнішню систему
              швидких платежів,
            </li>
            <li>готівкою або кредитною карткою при отриманні.</li>
          </ul>
        </li>
        <li>
          <p>
            Замовник повинен здійснити оплату Замовлення в розмірі, отриманому в
            результаті укладення Договору купівлі-продажу, в такі терміни:
          </p>
          <ul>
            <li>
              до 1 години &ndash; якщо ви вибрали форму оплати традиційним
              банківським переказом,
            </li>
            <li>
              до 1 години &ndash; якщо він обрав форму оплати банківською
              карткою, банківським переказом через зовнішню систему швидких
              платежів,
            </li>
            <li>
              при доставці Замовлення &ndash; якщо він вирішив оплатити 1)
              накладеним платежем або 2) готівкою або платіжною карткою з
              доставкою.
            </li>
          </ul>
        </li>
        <li>
          Неотримання клієнтом оплати в терміни, зазначені в пункті 8 вище дає
          право Продавцю відмовитися від Договору купівлі-продажу та анулювати
          Замовлення.
        </li>
        <li>
          Крім того, Продавець в будь-якому випадку має право відмовитися від
          Договору купівлі-продажу, відповідно до ст.395 Цивільного кодексу, до
          дати отримання Товару Покупцем.
        </li>
      </ol>
      <h3>
        <strong>ПОВЕРНЕННЯ &ndash; ВІДМОВА ВІД ДОГОВОРУ </strong>
      </h3>
      <ol>
        <li>
          Відповідно до умов даного Регламенту, Споживач має право відмовитися
          від Договору купівлі-продажу без пояснення причин протягом 14 днів.
          Відмовитись від Договору купівлі-продажу Споживач має право лише якщо
          Товар не немає слідів використання.
        </li>
        <li>
          <p>Період для виходу з Договору починається з:</p>
          <ol>
            <li>
              Договір купівлі-продажу, за яким Продавець видає Товар, будучи
              зобов&rsquo;язаним передати його право власності &ndash; від
              заволодіння Товаром Споживачем або третьою особою, зазначеною ним
              іншою особою, ніж перевізник,
            </li>
            <li>
              Договір купівлі-продажу, який включає в себе багато Товарів, що
              поставляються окремо, партіями або частинами &ndash; від
              заволодіння останнім Товаром, партіями або деталями,
            </li>
            <li>
              Договір купівлі-продажу, який полягає в регулярній доставці Товару
              протягом певного періоду часу &ndash; з моменту заволодіння першим
              з Товарів,
            </li>
            <li>
              інші Договори купівлі-продажу &ndash; з дати укладення Договору
              купівлі-продажу.
            </li>
          </ol>
        </li>
        <li>
          Споживач може відмовитися від Договору купівлі-продажу, роздрукувавши
          з Веб-сайту, заповнивши, підписавши і направивши Продавцю Заявку
        </li>
        <li>
          Продавець зобов&rsquo;язаний негайно, не пізніше ніж протягом 14 днів
          з дня отримання заяви Споживача про відмову від Договору
          купівлі-продажу, повернути Споживачу всі здійснені ним платежі,
          включаючи витрати на доставку Товару.
        </li>
        <li>
          Продавець повертає оплату з використанням того ж способу оплати, що і
          використаний Споживачем, хіба що Споживач прямо погодився на інший
          спосіб повернення коштів, який не передбачає для нього будь-яких
          витрат. Продавець не має права повертати платіж особі, яка не є
          Споживачем.
        </li>
        <li>
          Якщо Продавець не запропонував забрати Товар у Споживача самостійно,
          Продавець може утримати повернення платежів, отриманих від Споживача,
          до отримання ним Товару назад або надання Споживачем доказів його
          повернення, залежно від того, що відбудеться раніше.
        </li>
        <li>
          Якщо Споживач обрав інший спосіб доставки Товару, ніж запропонований
          Продавцем найдешевший звичайний спосіб доставки, Продавець не
          зобов&rsquo;язаний відшкодовувати Споживачеві понесені ним додаткові
          витрати.
        </li>
        <li>
          Споживач несе відповідальність за будь-яке зменшення вартості Товару в
          результаті його використання у спосіб, що виходить за рамки того, що
          необхідно для встановлення характеру, характеристик та функціонування
          Товару.
        </li>
        <li>
          Якщо Споживач користується правом відмовитися від Договору
          купівлі-продажу після подання запиту відповідно до пункту 3 статті 15
          та пункту 2 статті 21 Закону про захист прав споживачів (тобто після
          подання запиту на запуск послуги до кінцевого терміну відмови від
          Договору купівлі-продажу), він зобов&rsquo;язаний оплатити надані
          послуги до моменту відмови від Договору купівлі-продажу. Розмір оплати
          розраховується пропорційно обсягу наданої послуги з урахуванням Ціни,
          узгодженої в Договорі купівлі-продажу.
        </li>
      </ol>
    </div>
  );
};

export default TermsOfService;
