import styles from "./styles.module.scss"
import Modal from 'react-bootstrap/Modal'
import * as React from "react"
import { useRouter } from "next/router"


export default function PersonalDataPolicy(props) {
    const router = useRouter();
    return (
        <Modal
            {...props}
            size={"xl"}
            aria-labelledby="contained-modal-title-vcenter"
            centered>
            <div className={styles.modaldiv}>
                <Modal.Header className={styles.modalheader} closeButton >
                    Положення про обробку і захист персональних даних
                </Modal.Header>
                <Modal.Body className={styles.modalbody}>
                    <p className={styles.title}>Зміст</p>
                    <p>1. Загальні положення та сфера застосування.<br />
                        2. Склад та зміст персональних даних.<br />
                        3. Мета, межі та строки обробки персональних даних.<br />
                        4. Місцезнаходження персональних даних.<br />
                        5. Умови розкриття інформації про персональні дані третім особам.<br />
                        6. Захист персональних даних.<br />
                        7. Права Користувача (суб’єкта персональних даних).<br />
                        8. Порядок роботи з запитами суб’єктів персональних даних (Користувачів).<br />
                        9. Внесення змін до Положення.</p>
                    <p className={styles.title}>1. Загальні положення та сфера застосування.</p>
                    <p>1.1. Це Положення про обробку та захист персональних даних (надалі – «Положення») розроблене ТОВ «ПЛАМ. УА» (код ЄДРПОУ: 37193071, адреса: м. Київ, бул. Дружби Народів, 8-А, надалі – «Товариство» та/або «Володілець даних») у відповідності до чинного законодавства України, в тому числі, але не виключно, Закону України «Про захист персональних даних» від 01 червня 2010 року № 2297-VI і встановлює порядок отримання, збору, накопичення, зберігання, обробки, використання, забезпечення захисту і розкриття персональних даних (надалі – «Дані» та/або «Персональні дані») за допомогою веб-сайту: rozetka.com.ua (надалі – «Сайт») та/або мобільного додатку: “PLUM” (надалі – «Мобільний додаток» та/або «Мобільний додаток “PLUM”) та/або пов&apos;язаних з ними послуг та інструментів.</p>
                    <p>1.2. Здійснивши реєстрацію на Сайті plum.com.ua або авторизацію за допомогою мобільного додатку “PLUM” (завантажений за допомогою Play Market та App Store), та починаючи використання Інтернет-магазину, або при спробі оформити замовлення без попередньої реєстрації, Користувач (Покупець) надає дозвіл та однозначну згоду на обробку його персональних даних на умовах та в порядку, що викладені нижче, а також підтверджує ознайомлення з цим Положенням, його прийняття та згоду з його змістом.</p>
                    <p>1.3. Під Он-лайн платформою PLUM в цьому Положенні маються Сайт та Мобільний додаток разом, які разом використовуються також як «Інтернет-магазин» та/або «Он-лайн платформа PLUM» та/або «Он-лайн платформа».</p>
                    <p>1.4. Володільцем персональних даних Користувачів є ТОВ «ПЛАМ. УА» (код ЄДРПОУ: 37193071, адреса: м. Київ, бул. Дружби Народів, 8-А).</p>
                    <p>1.5. У цьому Положенні всі терміни використовуються в значенні, визначеному у Закону України «Про захист персональних даних» від 01 червня 2010 року № 2297-VI.</p>
                    <p>1.6. На Сайті можуть бути посилання на інші веб-сайти (виключно в інформаційних цілях). При переході за посиланням на інші веб-сайти дія цього Положення на такі сайти не поширюватиметься. У зв&apos;язку з чим, Товариство рекомендує ознайомитися з політикою в сфері конфіденційності та персональних даних кожного сайту перед тим, як передавати персональні дані, за якими Ви можете бути ідентифіковані.</p>
                    <p>1.7. Дане Положення обов’язкове для застосування відповідальною особою та співробітниками Інтернет-магазину, які безпосередньо здійснюють обробку та/або мають доступ до персональних даних у зв’язку з виконанням своїх службових обов’язків.</p>
                    <h4>2. Склад та зміст персональних даних.</h4>
                    <p>2.1. Під Даними розуміється будь-яка інформація, що прямо чи опосередковано відноситься до конкретного Користувача. Це може бути:ім’я, прізвище, по-батькові (у разі наявності), номер телефона, адреса електронної пошти, дата народження, наявність дітей, стать, захоплення, наявність домашніх тварин, наявність автомобіля та його VIN номер, мову спілкування, адреса місця проживання/перебування/доставки, інформація про дії Користувача під час використання Інтернет-магазину, IP-адреса, дані про пристрої, що використовуються Користувачем (тип пристрою, тип браузера, операційна система пристрою), історія повідомлень (інформація, яка міститься в переписці між Користувачем з адміністрацією Інтернет-магазину або зі сторонніми продавцями маркетплейсу), історія відгуків чи коментарів, інша інформація, за допомогою якої здійснюється комунікація, та яка за бажанням Користувача надається ним в реєстраційній формі та/або при заповненні власного профілю в Інтернет-магазин, при проходженні опитування (шляхом заповнення анкети або в інший спосіб), або інформація отримана при усній комунікації Користувача і адміністрації Сайту, інформація, яка надається при здійсненні оплати в Інтернет-магазині (в тому числі під час покупки товарів та/або послуг, які пропонуються в Інтернет-магазині в кредит/оплату частинами. Зокрема: інформація щодо паспортних даних Користувача, ідентифікаційного коду та інше).
                        Даний перелік персональних даних не є сталим та обов’язковим для усіх Користувачів, а залежить від потреб та бажань самого Користувача та від тих операцій, які він/вона виконує в Інтернет-магазині.
                        Під Даними також розуміється інша інформація, отримана Інтернет-магазином на законних підставах від третіх осіб та/або доступна з профайлів Користувача у соціальних мережах – у випадку реєстрації в Інтернет-магазині за допомогою служб автентифікації соціальних мереж. В такому випадку Користувач надає свою згоду на обробку інформації, що доступна із відповідних облікових записів (профайлів) у соціальних мережах.</p>
                    <p>2.2. Користувачі несуть відповідальність за всю інформацію, що розміщується ними в загальнодоступних облікових записах. Користувач повинен усвідомити всі ризики, пов&apos;язані з тим, що він оприлюднює адресу або інформацію про точне місце свого розташування. Якщо Користувач вирішив увійти на Он-лайн платформу, використовуючи службу автентифікації стороннього оператора, наприклад інформацію Facebook, Товариство може отримати додатковий профіль, або іншу інформацію, доступ до якої надано такою третьою особою.</p>
                    <p className={styles.title}>3. Мета, межі та строки обробки персональних даних.</p>
                    <p>3.1. Метою обробки персональних даних є:
                        забезпечення реалізації цивільно-правових відносин, господарських, податкових відносин, здійснення покладених на Товариство функцій, повноважень та обов’язків у відповідності до діючого законодавства України;
                        ідентифікації клієнта як Користувача Інтернет-магазину, для зв’язку з Користувачем в тому числі для надання послуг, обробки платежів, відправки, проведення розрахункових операцій, надання звітності, ведення бухгалтерського та управлінського обліку, створення і реалізації бонусних програм, програм лояльності, відправки розсилок поштою, електронною поштою, за номером телефону, в тому числі з метою відправки комерційних пропозицій, повідомлень про акції та новини Інтернет-магазину, та/або для надання Користувачам Інтернет-магазину фінансових послуг (що надаються третіми особами та/або партнерами Товариства), з метою покращення якості товарів/надання послуг, формування рейтингів товарів та пропозицій Інтернет-магазину, аналізу активності Користувачів, здійснення пошуку по ключовим словам, управління трафіком в Інтернет-магазині, аналізу і прогнозування уподобань, інтересів Користувачів для формування найбільш релевантних та вигідних персональних пропозицій або акційних пропозицій; проведення науково-дослідної та аналітичної активності, направлення інформаційних та маркетингових розсилок (новини, акції компанії, інформацію про акції, промокоди та знижки, персональні рекомендації, персональні знижки та пропозиції), які містять інформацію щодо товарів та/або послуг, рекламні та комерційні пропозиції щодо таких товарів та/або послуг та ін.;
                        з метою направлення розсилок, комерційних пропозицій, повідомлень про акції, програми лояльності, бонусні програми та/або з метою направлення повідомлень щодо функціонування Інтернет-магазину поштою, електронною поштою, за номером телефону, шляхом надсилання інформаційних повідомлень та оповіщень в Мобільному додатку. Користувач може у будь-який момент відмовитися від отримання інформаційних та маркетингових розсилок – через відповідні налаштування на Сайті https://plum.com.ua/ua/cabinet/subscribes/ .;
                        з метою виконання інших обов&apos;язків покладених законом на Володільця персональними даними, для захисту законних інтересів володільця персональних даних або третьої особи, якій передаються персональні дані.</p>
                    <p>3.2. Товариство не здійснює обробку даних, які стосуються расової, національної приналежності, політичних поглядів, релігійних та інших переконань, членства в громадських організаціях. Інформація, яка характеризує фізіологічні особливості Користувачів, на основі яких можна встановити їх особистість не обробляються також.</p>
                    <p>3.3. Строки обробки та зберігання Даних визначаються виходячи із цілей обробки Даних, а також виходячи із умов, вказаних в договорах, укладених з Користувачами у відповідності до вимог діючого законодавства України. Персональні дані обробляються та зберігаються настільки довго, наскільки це необхідно для досягнення цілей, заради яких вони були зібрані, в тому числі для виконання будь-яких юридичних, бухгалтерських вимог, або вимог щодо звітності або до моменту видалення даних Користувачем або за запитом Користувача.</p>
                    <p>3.4. Користувачі в будь-який момент можуть змінити/видалити особисту інформацію або відмовитися від розсилки повідомлень, або відкликати згоду на обробку Даних. Це можна зробити у своєму Особистому кабінеті або, шляхом направлення повідомлення на електронну адресу: cab@plum.com.ua з поміткою в темі листа «Персональні дані». Видалення облікового запису (аккаунту) за ініціативою Користувача відбувається в порядку, визначеному в Угоді користувача та в Умовах використання Сайту: https://plum.com.ua/ua/pages/terms/ .</p>
                    <p>3.5. У випадку відсутності активності у обліковому записі Користувача протягом строку, що перевищує 5 (п‘ять) років, Товариство залишає за собою право видалити обліковий запис Користувача, включаючи всі особисті дані, що зберігаються в обліковому записі, що означає, що ви більше не зможете отримати до нього доступ і використовувати його.</p>
                </Modal.Body>
            </div>
        </Modal>
    )
}
