import styles from "./styles.module.scss";
import Modal from "react-bootstrap/Modal";
import * as React from "react";
import { useRouter } from "next/router";

export default function UserConditions(props) {
  const router = useRouter();
  return (
    <Modal
      {...props}
      size={"xl"}
      aria-labelledby="contained-modal-title-vcenter"
      centered
    >
      <div className={styles.modaldiv}>
        <Modal.Header className={styles.modalheader} closeButton>
          Угоди користувача
        </Modal.Header>
        <Modal.Body className={styles.modalbody}>
          <p className={styles.title}> Угоди користувача</p>
          <p>
            Я (надалі – «Я» та/або «Користувач») погоджуюсь з умовами цієї Угоди
            користувача і, використовуючи сайт: rozetka.com.ua (надалі – «Сайт»)
            та/або мобільний додаток PLUM (надалі – «Мобільний додаток») та/або
            інші сервіси (надалі разом іменуються як «Он-лайн платформа PLUM»
            та/або «Он-лайн платформа»), при замовленні, листуванні, телефонній
            розмові, залишенні відгуків тощо, надаю згоду на обробку і захист
            своїх персональних даних, як Користувача, в обсязі, порядку,
            відповідно до мети обробки згідно з Положенням про обробку
            персональних даних, розміщеному:
            https://help.plum.com.ua/hc/uk/articles/360055893552 (надалі –
            «Положення» та/або «Положення про обробку і захист персональних
            даних»).
          </p>
          <p className={styles.title}>Персональні дані</p>
          <p>
            У доповнення до Положення, на виконання вимог Закону України "Про
            захист персональних даних" шляхом заповнення на Онлайн-платформі
            заявки для розгляду можливості придбання товару в кредит та
            натискання кнопки «Замовлення підтверджую» даю згоду на обробку
            вказаних у заявці моїх персональних даних наступними особами: АТ
            «ПУМБ» (код ЄДРПОУ - 14282829), АТ «ОТП БAНК» (код ЄДРПОУ–
            21685166), АТ "УКРСИББАНК" (код ЄДРПОУ– 09807750), ТОВ "ФК"ЦФР" (код
            ЄДРПОУ– 35725063), АТ "АЛЬФА-БАНК" (код ЄДРПОУ– 23494714), АТ КБ
            «ПРИВАТБАНК» (код ЄДРПОУ – 14360570), АТ "УНІВЕРСАЛ БАНК" (код
            ЄДРПОУ – 21133352), та іншим фінансовим установам, що надають
            можливість кредитування на Он-лайн платформі Rozetka, з метою
            забезпечення реалізації цивільно-правових відносин,
            надання/отримання та здійснення розрахунків за придбані
            товари/послуги, в тому числі шляхом кредитування. Не заперечую щодо
            перевірки переліченими у цій Угоді фінансовими установами інформації
            у будь-яких бюро кредитних історій України з метою з’ясування
            відомостей, які стосуються виконання мною взятих на себе зобов’язань
            по договорам (в т.ч. кредитним), у випадку наявності таких, тим
            самим розуміючи, що об’єм інформації, яка буде перевірятися, може
            включати в себе інформацію, яка стосується банківської таємниці, і
            з’ясування якої буде такою, яка буде повною та достатньою для
            розуміння мого соціального, майнового стану, платоспроможності та
            несення можливої подальшої майнової відповідальності, у випадку її
            необхідності. Я також погоджуюсь з тим, що Володілець має право
            надавати доступ та передавати мої персональні дані третім особам без
            будь-яких додаткових повідомлень, не змінюючи при цьому мети їх
            обробки, визначеної в Положенні та цій Угоді. В тому числі, на
            перевірку зазначеної Мною інформації та не заперечую про передачу
            для можливого необхідного з&apos;ясування даної інформації третім особам,
            під якими розумію: фінансові установи, колекторські компанії,
            оператори мобільного та поштового зв’язку, інші фізичні та/або
            юридичні особи. Надаю згоду запитувати та отримувати в бюро
            кредитних історій, включених до Єдиного реєстру бюро кредитних
            історій (надалі – «Бюро»), дані та інформацію у вигляді зведених
            показників, сформованих на основі інформації, що міститься у моїй
            кредитній історії та/або на основі інформації доступної з відкритих
            джерел, від третіх осіб, з використанням доступних Бюро моделей
            розрахунку, а також на використання зазначеної інформації
            володільцем та/або третіми особами для визначення та пропонування
            мені Володільцем в особистому кабінеті на Он-лайн платформі PLUM
            https://plum.com.ua/ маркетингових/спеціальних пропозицій(фінансових
            лімітів) для придбання товарів та/або послуг. Ми цінуємо ваше право
            на особисте життя та нерозголошення вашої персональної інформації.
            Ця Угода користувача — правило, яким користуються всі співробітники
            нашого сервісу, та регламентує збір і використання особистої
            інформації, яка може бути запитана/отримана при відвідуванні Он-лайн
            платформи PLUM: https://plum.com.ua/ua/https://plum.com.ua/ua/, при
            використанні сервісу, при замовленні, листуванні, телефонній
            розмові, будь-якої іншої комунікації, при якій здійснюється обмін
            даними/інформацією. Якщо у вас виникнуть питання або проблеми у
            зв’язку з конфіденційністю, надсилайте, будь ласка, свої питання або
            зауваження на електронну адресу: cab@plum.com.ua.
          </p>
          <p className={styles.title}>Яку інформацію ми збираємо</p>
          <p>
            На Он-лайн платформі Rozetka, в разі, коли ви робите замовлення,
            берете участь в акції, дослідженнях або іншим чином взаємодієте з
            нами, ми збираємо як особисту інформацію, так і загальні дані.
            Особиста інформація стосується окремого користувача та обробляється
            в порядку, межах, з метою, визначених в Положенні. Ми не вимагаємо
            реєстрації або надання такої інформації для перегляду нашої Он-лайн
            платформи та отримання доступу до його змісту. Для того щоб зробити
            замовлення товарів/послуг, брати участь у акціях, дослідженнях або
            іншим чином взаємодіяти з нами, ви повинні уважно ознайомитися з
            вашими правами та обов’язками щодо обробки персональних даних, які
            зазначені в ст. 8 Законі України «Про захист персональних даних» та
            Положенні, уважно ознайомитися з даною Угодою користувача та
            Положенням, а також висловити свою повну згоду з їх умовами. Якщо ви
            не погоджуєтеся з будь-якою з умов даної Угоди користувача та
            Положення про обробку і захист персональних даних, будь ласка, не
            надавайте особисту інформацію (персональні дані). Згоду на
            використання вашої особистої інформації ви можете відкликати в
            будь-який момент. Для цього достатньо надіслати повідомлення
            електронною поштою, з поміткою в темі листа «Персональні дані», за
            адресою: cab@plum.com.ua.
          </p>
          <p className={styles.title}>Чому ми обробляємо персональні дані</p>
          <p>
            Термін «персональні дані» використовується в значенні, визначеному в
            Законі України «Про захист персональних даних» та становить
            сукупність відомостей про користуваня, які визначаються в Положенні.
            Ми можемо обробляти ваші персональні дані для цілей та з метою,
            визначених в Положенні. При цьому одночасно можуть застосовуватися
            одна або кілька цілей. Ми діємо відповідно до цієї Угоди
            користувача, на підставі Положення про обробку і захист персональних
            даних та на підставі чинного законодавства України. Володільцем
            персональних даних є ТОВ «ПЛАМ. УА», що знаходиться за адресою : м.
            Київ, бул. Дружби Народів, 8-А. Ми маємо право зберігати Персональні
            дані стільки, скільки необхідно для реалізації мети, що зазначена у
            даній Угоді користувача та Положенні.
          </p>
        </Modal.Body>
      </div>
    </Modal>
  );
}
